---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameter.IsDeterminedByFormula
source: html/5d5bd93e-f406-8189-3d82-0c0be2982914.htm
---
# Autodesk.Revit.DB.FamilyParameter.IsDeterminedByFormula Property

Indicates if the parameter is determined by formula.

## Syntax (C#)
```csharp
public bool IsDeterminedByFormula { get; }
```

## Remarks
The parameter is read only if it is determined by formula.